app/Http/Controllers/Panel/QuizQuestionController.php

select * from `quizzes_questions` where `id` = '24' and `creator_id` = 2 limit 1
---
    public function edit(Request $request, $question_id)
    {
        $user = auth()->user();

        $question = QuizzesQuestion::where('id', $question_id)
            ->where('creator_id', $user->id)
            ->first();

delete from `quizzes_questions` where `id` = '25' and `creator_id` = 2
---
    public function destroy(Request $request, $id)
    {
        QuizzesQuestion::where('id', $id)
            ->where('creator_id', auth()->user()->id)
            ->delete();