app/Http/Controllers/Admin/QuizQuestionController.php

select * from `quizzes_questions` where `id` = '37' limit 1
---
    public function edit($question_id)
    {
        $question = QuizzesQuestion::where('id', $question_id)->first();